<table align="center" width=100%>
    <tr>
        <td width="15%">
            <img src="homework.png">
        </td>
        <td>
            <div align="center">
                <font color="#21618C" size=8px>
                    <b> Take-Home <br>(Day 2)
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

### Let's begin with some hands-on practice exercises

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 1. Create a dictionary named 'europe_dict' which has names of countries in europe, their capital and their population. 
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table>
  <tr>
  <th>Country </th>
  <th>Capital</th>
  <th>Population</th>    
  </tr>
  <tr>
  <td>Spain</td>
  <td>Madrid</td>
  <td>46.77</td>    
  </tr>
  <tr>
  <td>France</td>
  <td>Paris</td>
  <td>66.03</td> 
  </tr>
  <tr>
  <td>Germany</td>
  <td>Berlin</td>
  <td>80.62</td> 
  </tr>
  <tr>
  <td>Norway</td>
  <td>Oslo</td>
  <td>5.084 </td> 
</tr>
</table>

In [1]:
# importing pandas
import pandas as pd                                       

# Creating a dictionary
europe_dict = {
       # Country is the key and the list of countries is its value
       "Country":["Spain","France","Germany","Norway"],  
       # Capital is the key and the list of capitals is its value
       "Capital":["Madrid","Paris","Berlin","Oslo"],
       # Population is the key and the list of populations is its value
       "Population":[46.77,66.03,80.62,5.084]
}

# converting the dictionary into a dataframe
europe_df = pd.DataFrame(europe_dict)

# printing the dataframe
print(europe_df)

   Country Capital  Population
0    Spain  Madrid      46.770
1   France   Paris      66.030
2  Germany  Berlin      80.620
3   Norway    Oslo       5.084

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 2. In the data in question 1, add a new column 'FamousFor'. The column tells what each country is famous for.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table>
  <tr>
  <th>Country </th>
  <th>FamousFor</th>   
  </tr>
  <tr>
  <td>Spain</td>
  <td>Football</td>  
  </tr>
  <tr>
  <td>France</td>
  <td>Eiffel Tower</td>
  </tr>
  <tr>
  <td>Germany</td>
  <td>Cars</td>
  </tr>
  <tr>
  <td>Norway</td>
  <td>Midnight sun</td>
</tr>
</table>

In [2]:
# add a new column 'FamousFor'
# if a list is assigned to a column, then its elements become the values of that column
europe_df['FamousFor'] = ['Football','Eiffel Tower','Cars','Midnight sun']

# printing the dataframe
print(europe_df)

   Country Capital  Population     FamousFor
0    Spain  Madrid      46.770      Football
1   France   Paris      66.030  Eiffel Tower
2  Germany  Berlin      80.620          Cars
3   Norway    Oslo       5.084  Midnight sun

**Note:** Assigning a column that doesnâ€™t exist will create a new column.

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 3. Use the data created in question 1, to do the following:
                          <ol type = '1'>
                              <li>  Access column 'Captial' by specifying the column number. </li>
                              <li>  Access column 'Population' by specifying the column name.
                              <li>  Access a country information </li>
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [3]:
# 1. Access column 'Captial' by specifying the column number.

# iloc() works on index positions. Here we are accessing the column with index position 1 i.e. column 'Capital'
europe_df.iloc[:,1]

0    Madrid
1     Paris
2    Berlin
3      Oslo
Name: Capital, dtype: object

In [4]:
# 2. Access column 'Population' by specifying the column name.

# accessing a column by directly calling it
europe_df.Population                
# OR
# accessing a column by passing the column names inside the square brackets
europe_df["Population"]

# Use any one command

0    46.770
1    66.030
2    80.620
3     5.084
Name: Population, dtype: float64

In [5]:
# 3. Access a country information
# say we want access information for France

# loc works on index positions. Here the index values and index positions are same.
europe_df.loc[1]

Country             France
Capital              Paris
Population           66.03
FamousFor     Eiffel Tower
Name: 1, dtype: object

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 4. Read a csv file "products.csv", print it and also check its dimensions
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [6]:
# storing the dataframe inside a variable example.
df_products = pd.read_csv("products.csv")

# Printing the dataframe
print(df_products)

  Product ID  Cost Price  Selling Price
0       45SD          60            135
1       12PO          43            121
2       54PL          78            150
3       26PL          65            121
4       68HG          50            132
5       21ER         150            152
6       10FG         132            165
7       57HB         134            161
8       75VB         109            124
9      32HJH         121            152

In [7]:
# check dimension/shape of the dataframe
dimension = df_products.shape

# shape returns a tuple where value at index 0 represents number of rows and value at index 1 represents the number of columns
print(" The dataframe 'products' has %d columns and %d rows." %(dimension[1], dimension[0]))

 The dataframe 'products' has 3 columns and 10 rows.

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 5. Create a new column Profit, calculate the profit using selling price and the cost price.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [8]:
# creating an empty list
profit = []

# iterating the for loop for the number of rows 
for i in range(dimension[0]):
    # Accessing the cell value at index position i in the column 'Cost Price'
    cp = df_products["Cost Price"].iloc[i]
    # Accessing the cell value at index position i in the column 'Selling Price'
    sp = df_products["Selling Price"].iloc[i]
    # Taking the difference between selling price and cost price and appending the result in the profit list.
    profit.append(sp - cp)
    
# OR use the following to calculate profits
# Profits = example["Selling Price"] - example["Cost Price"]

# appending a new column Profit at the index value 3 in the dataframe example
df_products.insert(loc = 3 , column = 'Profit',value = profit)

# printing the dataframe
print(df_products)

  Product ID  Cost Price  Selling Price  Profit
0       45SD          60            135      75
1       12PO          43            121      78
2       54PL          78            150      72
3       26PL          65            121      56
4       68HG          50            132      82
5       21ER         150            152       2
6       10FG         132            165      33
7       57HB         134            161      27
8       75VB         109            124      15
9      32HJH         121            152      31

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 6. Create a pandas series having values 4, 7, -5, 3, NAN and their index as d, b, a, c, e
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [9]:
# importing the numpy library
import numpy as np

# creating a new series
series = pd.Series([4, 7, -5, 3, np.nan], index=['d', 'b', 'a', 'c',"e"])

# printing the newly created series
print(series)

d    4.0
b    7.0
a   -5.0
c    3.0
e    NaN
dtype: float64

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 7. Using the series in question 6, find:
                        <ol type = '1'>
                            <li> the minimum of all values </li>
                            <li> the maximum of all value </li>
                        </ol>
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [10]:
# the minimum of all values
# min() finds the minimum value from the series inspite of having the Null value in the series
series.min()

-5.0

In [11]:
# the maximum of all value
# max() finds the maximum value from the series inspite of having the Null value in the series
series.max()

7.0

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 8. Using the series in question 6, sort:
                         <ol type = '1'>
                             <li>  the values in ascending order </li>
                             <li>  the values in decending order  </li>
                        </ol>
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [21]:
# sorting the values in ascending order
series.sort_values(ascending=True)

# the value for ascending is 'True' by default

a   -5.0
c    3.0
d    4.0
b    7.0
e    NaN
dtype: float64

In [22]:
# sorting the values in decending order
# False value of the parameter ascending indicates that sorting will be in descending order
series.sort_values(ascending=False)

b    7.0
d    4.0
c    3.0
a   -5.0
e    NaN
dtype: float64

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 9. Import dataset 'flights' from library seaborn. Print the first 10 rows and last 20 rows of the data set.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [14]:
# import required libraries
import seaborn as sns

# load the flights data set as flight
flight = sns.load_dataset('flights')

In [15]:
# by default without any parameters, head() displays the top 5 observations of a dataframe
# here head(10) will display top 10 observations of a dataframe
flight.head(10)

   year      month  passengers
0  1949    January         112
1  1949   February         118
2  1949      March         132
3  1949      April         129
4  1949        May         121
5  1949       June         135
6  1949       July         148
7  1949     August         148
8  1949  September         136
9  1949    October         119

In [16]:
# by default without any parameters, tail() displays the bottom 5 observations of a dataframe
# here tail(20) will display bottom 20 observations of a dataframe
flight.tail(20)

     year      month  passengers
124  1959        May         420
125  1959       June         472
126  1959       July         548
127  1959     August         559
128  1959  September         463
129  1959    October         407
130  1959   November         362
131  1959   December         405
132  1960    January         417
133  1960   February         391
134  1960      March         419
135  1960      April         461
136  1960        May         472
137  1960       June         535
138  1960       July         622
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 10. Import dataset 'iris' from library seaborn. Check for datatypes of all variable.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

In [17]:
# import required libraries
import seaborn as sns

# load the iris data set as iris
iris = sns.load_dataset('iris')

In [18]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object